In [2]:
import numpy as np
import pandas as pd

In [3]:
lista = [1,1,2,0,3,2,1,4,2,3,1,0,0,1,2]

In [4]:
df = pd.DataFrame()

In [5]:
df['nota']=lista

In [6]:
df

    nota
0      1
1      1
2      2
3      0
4      3
5      2
6      1
7      4
8      2
9      3
10     1
11     0
12     0
13     1
14     2

In [9]:
df.describe()

            nota
count  15.000000
mean    1.533333
std     1.187234
min     0.000000
25%     1.000000
50%     1.000000
75%     2.000000
max     4.000000

In [10]:
df.count()

nota    15
dtype: int64

In [12]:
len(df)

15

In [14]:
df['nota'].value_counts()

1    5
2    4
0    3
3    2
4    1
Name: nota, dtype: int64

In [15]:
df['nota'].nunique()

5

In [11]:
df.head(5)

   nota
0     1
1     1
2     2
3     0
4     3

In [16]:
df.sort_values('nota')

    nota
3      0
11     0
12     0
0      1
1      1
6      1
10     1
13     1
2      2
5      2
8      2
14     2
4      3
9      3
7      4

In [18]:
df.sort_values('nota',ascending=False)

    nota
7      4
4      3
9      3
2      2
5      2
8      2
14     2
0      1
1      1
6      1
10     1
13     1
3      0
11     0
12     0

In [19]:
df.tail(5)

    nota
10     1
11     0
12     0
13     1
14     2

In [7]:
# Generar tabla de frecuencias
tab = pd.crosstab(index=df["nota"],columns="frecuencia")
print(tab)

col_0  frecuencia
nota
0               3
1               5
2               4
3               2
4               1